Repository: rehab-eng/wolf_strikes
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Home
ar: الرئيسية

source: Robotics Team
ar: فريق الروبوتات

source: ByteHope Technology. All rights reserved. | Wolf Strikes Robotics Team
ar: ByteHope Technology. جميع الحقوق محفوظة | فريق وولف سترايكس للروبوتات

source: About
ar: من نحن

source: Projects
ar: المشاريع

source: Team
ar: الفريق

source: Contact
ar: تواصل

source: Innovative robotics team pushing the boundaries of technology and innovation.
ar: فريق روبوتات مبتكر يدفع حدود التقنية والابتكار.

source: Quick Links
ar: روابط سريعة

source: Our Mission
ar: مهمتنا

source: To inspire innovation and build the next generation of robotics engineers through cutting-edge technology and teamwork.
ar: إلهام الابتكار وبناء الجيل القادم من مهندسي الروبوتات عبر التقنيات المتقدمة والعمل الجماعي.

source: Innovative Robotics Team Pushing the Boundaries of Technology
ar: فريق روبوتات مبتكر يدفع حدود التكنولوجيا

source: Welcome to our website
ar: مرحباً بكم في موقعنا

source: Friendly Robot
ar: روبوت ترحيبي

source: Explore Projects
ar: استكشف المشاريع

source: Get In Touch
ar: تواصل معنا

source: What We Do
ar: ماذا نفعل

source: Cutting-edge robotics solutions for the future
ar: حلول روبوتية متقدمة للمستقبل

source: Design Lab
ar: مختبر التصميم

source: Advanced Design
ar: تصميم متقدم

source: We design state-of-the-art robots using cutting-edge technology and innovative approaches.
ar: نصمم روبوتات متطورة باستخدام أحدث التقنيات وأساليب مبتكرة.

source: Rapid prototyping and CAD
ar: نمذجة سريعة وتصميم CAD

source: Human-centered research
ar: أبحاث متمحورة حول الإنسان

source: Simulation-driven iterations
ar: تكرارات مدفوعة بالمحاكاة

source: Engineering Core
ar: قلب الهندسة

source: Precision Engineering
ar: هندسة دقيقة

source: Our team combines mechanical, electrical, and software engineering to create high-performance systems.
ar: يجمع فريقنا بين الهندسة الميكانيكية والكهربائية والبرمجية لبناء أنظمة عالية الأداء.

source: Electronics, mechanics, and control integration
ar: تكامل الإلكترونيات والميكانيكا والتحكم

source: Embedded systems programming
ar: برمجة الأنظمة المدمجة

source: Reliability testing
ar: اختبارات الاعتمادية

source: Competitive Edge
ar: أفضلية تنافسية

source: Award-Winning
ar: حائزة على جوائز

source: We've achieved recognition at national and international robotics competitions.
ar: حققنا اعترافاً في مسابقات الروبوتات المحلية والدولية.

source: Strategy and scouting
ar: استراتيجية واستكشاف

source: Field-ready prototypes
ar: نماذج جاهزة للميدان

source: Awards and recognition
ar: جوائز واعترافات

source: About Us
ar: من نحن

source: About Wolf Strikes
ar: عن وولف سترايكس

source: Leading the Future of Robotics Innovation
ar: نقود مستقبل ابتكار الروبوتات

source: Wolf Strikes is dedicated to developing innovative robotic solutions that push the boundaries of technology and engineering. We combine cutting-edge research, creative problem-solving, and meticulous engineering to create robots that make a real difference.
ar: وولف سترايكس مكرس لتطوير حلول روبوتية مبتكرة تدفع حدود التكنولوجيا والهندسة. نجمع بين الأبحاث المتقدمة وحل المشكلات الإبداعي والهندسة الدقيقة لصنع روبوتات تُحدث فرقاً حقيقياً.

source: Our Values
ar: قيمنا

source: Innovation
ar: الابتكار

source: Constantly pushing the limits of what's possible in robotics and automation.
ar: ندفع باستمرار حدود الممكن في الروبوتات والأتمتة.

source: Collaboration
ar: التعاون

source: We work as a unified team where every member contributes their expertise to achieve our collective goals.
ar: نعمل كفريق واحد يساهم فيه كل عضو بخبرته لتحقيق أهدافنا المشتركة.

source: Excellence
ar: التميز

source: We strive for excellence in every aspect of our work, from design to implementation and testing.
ar: نسعى للتميز في كل جانب من عملنا، من التصميم إلى التنفيذ والاختبار.

source: Our Story
ar: قصتنا

source: In 2025, a new spark of innovation lit up within Libya's growing tech community. At the heart of this spark stood Amal Bwaer, a fifteen-year-old girl whose ambitions were far greater than her age. Driven by curiosity and a desire to build something meaningful, she founded Wolf Strikes, a robotics team that would soon become a gathering point for some of the brightest young minds in the country.
ar: في عام 2025، اشتعلت شرارة جديدة من الابتكار داخل مجتمع التكنولوجيا المتنامي في ليبيا. وفي قلب هذه الشرارة كانت أمل بوير، فتاة في الخامسة عشرة من عمرها كانت طموحاتها أكبر بكثير من سنها. بدافع الفضول والرغبة في بناء شيء ذي معنى، أسست فريق وولف سترايكس للروبوتات، الذي سرعان ما أصبح نقطة تجمع لبعض ألمع العقول الشابة في البلاد.

source: What started as a small dream quickly evolved into a vision. The team worked together not just to build robots, but to build confidence, knowledge, and a supportive community. Their sessions were filled with brainstorming, testing, failing, learning, and trying again — because for them, robotics was more than circuits and code; it was a journey of growth.
ar: ما بدأ كحلم صغير تطور بسرعة إلى رؤية. عمل الفريق معاً ليس فقط لبناء روبوتات، بل لبناء الثقة والمعرفة ومجتمع داعم. كانت جلساتهم مليئة بالعصف الذهني والاختبار والإخفاق والتعلم والمحاولة مرة أخرى — لأن الروبوتات بالنسبة لهم كانت أكثر من دوائر وشيفرات؛ كانت رحلة نمو.

source: Join Our Mission
ar: انضم إلى مهمتنا

source: Be part of the robotics revolution and help us shape the future.
ar: كن جزءاً من ثورة الروبوتات وساعدنا في تشكيل المستقبل.

source: Our Projects
ar: مشاريعنا

source: A showcase of our innovation and engineering excellence.
ar: عرض لابتكارنا وتميزنا الهندسي.

source: New Projects Launching Soon!
ar: مشاريع جديدة قريباً!

source: Our team is working hard behind the scenes to develop the next generation of robotic solutions. We are excited to unveil our latest projects soon. Stay tuned for groundbreaking innovations!
ar: يعمل فريقنا بجد خلف الكواليس لتطوير الجيل القادم من حلول الروبوتات. نحن متحمسون للكشف عن أحدث مشاريعنا قريباً. ترقبوا ابتكارات رائدة!

source: Get Notified
ar: أشعرني

source: Contact Us
ar: تواصل معنا

source: We'd love to hear from you. Let's build the future together.
ar: يسعدنا سماعك. لنَبْنِ المستقبل معاً.

source: Contact Page Under Construction
ar: صفحة التواصل قيد الإنشاء

source: Our contact form is being finalized. In the meantime, you can reach us via email. We look forward to connecting with you!
ar: نموذج التواصل قيد الإنهاء. في الوقت الحالي، يمكنك التواصل معنا عبر البريد الإلكتروني. نتطلع للتواصل معك!

source: Meet the Team
ar: تعرف على الفريق

source: The innovative minds behind Wolf Strikes.
ar: العقول المبتكرة وراء وولف سترايكس.

source: Leadership
ar: القيادة

source: Team Founder
ar: مؤسس الفريق

source: An ambitious and young founder with strong skills in leadership and youth project management.
ar: مؤسسة شابة طموحة بمهارات قوية في القيادة وإدارة مشاريع الشباب.

source: Creativity
ar: الإبداع

source: Organization
ar: التنظيم

source: Programming
ar: البرمجة

source: Head of Programming
ar: رئيس البرمجة

source: An expert programmer leading the development department, skilled in software development and problem-solving.
ar: مبرمج خبير يقود قسم التطوير، ماهر في تطوير البرمجيات وحل المشكلات.

source: Web Dev
ar: تطوير الويب

source: Problem-Solving
ar: حل المشكلات

source: Media
ar: الإعلام

source: Head of Media
ar: رئيس الإعلام

source: A creative media specialist, skilled in content creation and managing the team's visual identity.
ar: مختص إعلامي مبدع، ماهر في صناعة المحتوى وإدارة الهوية البصرية للفريق.

source: Design
ar: التصميم

source: Editing
ar: المونتاج

source: Photography
ar: التصوير

source: Coming Soon
ar: قريبًا

source: Awards
ar: الجوائز

source: The awards section will be updated soon with the team’s achievements and honors.
ar: سيتم تحديث قسم الجوائز قريبًا مع إنجازات الفريق وتكريماته.

source: Coming soon
ar: قريبًا

source: Our Sponsors
ar: الداعمون

source: Thanks to the partners who support our innovation journey
ar: شكرًا للشركاء الذين يدعمون رحلتنا الابتكارية

source: ByteHope Technology
ar: بايت هوب للتقنية

source: ByteHope Technology provided the technical support that helped the team go fully digital.
ar: قدمت بايت هوب للتقنية الدعم الفني الذي ساعد الفريق على التحول الرقمي.

source: Visible
ar: فيسبل

source: Visible designed the robot’s 3D components.
ar: صممت شركة فيسبل قطع الروبوت ثلاثية الأبعاد.

source: Almerfak Oil Services
ar: المرفق النفطية

source: Almerfak Oil Services provided financial support for the team.
ar: قدمت شركة المرفق النفطية دعمًا ماليًا للفريق.

source: Brack
ar: براك

source: A proud partner supporting the team’s journey.
ar: شريك داعم لمسيرة الفريق ونجاحاته.

source: Tarbah
ar: طربه

source: Provided valued support to strengthen the team’s progress.
ar: قدمت دعمًا مميزًا لتعزيز مسيرة الفريق.

source: Our Team - Wolf Strikes
ar: فريقنا - وولف سترايكس

source: The innovative minds behind Wolf Strikes' success
ar: العقول المبدعة وراء نجاح وولف سترايكس

source: Amal
ar: أمل

source: Head of Media Department
ar: قائدة قسم الإعلام

source: Leads the media team and manages the visual identity and communication.
ar: تقود فريق الإعلام وتدير الهوية البصرية والتواصل الإعلامي.

source: Media Management
ar: إدارة الإعلام

source: Visual Identity
ar: الهوية البصرية

source: Content Writing
ar: كتابة المحتوى

source: Mohammed Salah
ar: محمد صلاح

source: Programming Lead
ar: مسؤول البرمجة

source: An expert programmer leading software development and technical problem-solving.
ar: مبرمج خبير يقود تطوير البرمجيات ويعالج التحديات التقنية.

source: Web Development
ar: تطوير الويب

source: Problem Solving
ar: حل المشكلات

source: Saeed
ar: سعيد

source: Team Leader
ar: قائد الفريق

source: Leads the team and coordinates efforts across all departments.
ar: يتولى قيادة الفريق وتنسيق الجهود بين الأقسام.

source: Planning
ar: تخطيط

source: Maeen (Al-Afandi)
ar: معين (الأفندي)

source: Professional Programmer
ar: مبرمج محترف

source: Specialized in building advanced software solutions.
ar: متخصص في بناء حلول برمجية متقدمة.

source: Analysis
ar: تحليل

source: Mohammed Dawas
ar: محمد الدواس

source: Build & Programming Department
ar: قسم البناء والبرمجة

source: Contributes to construction and programming to ensure system integration.
ar: يسهم في البناء والبرمجة لضمان تكامل الأنظمة.

source: Implementation
ar: تنفيذ

source: Ali Nasser
ar: علي ناصر

source: Build Department
ar: قسم البناء

source: Focuses on assembling components with high precision.
ar: يعمل على تجميع المكونات بدقة عالية.

source: Assembly
ar: تركيب

source: Testing
ar: اختبار

source: Execution
ar: تنفيذ

source: Ayoub
ar: أيوب

source: Supports the build team in structure and component preparation.
ar: يساند فريق البناء في تجهيز الهياكل والقطع.

source: Build
ar: بناء

source: Precision
ar: دقة

source: Teamwork
ar: عمل جماعي

source: Ahmed Bosifi
ar: أحمد بوسيفي

source: Professional Python Programmer
ar: مبرمج محترف بلغة بايثون

source: Builds robust software solutions using Python.
ar: يطوّر حلولًا برمجية قوية باستخدام بايثون.

source: Automation
ar: أتمتة

source: Algorithms
ar: خوارزميات

source: Doaa
ar: دعاء

source: An active member in the build department with strong execution.
ar: عضوة نشيطة في قسم البناء ذات تنفيذ قوي.

source: Coordination
ar: تنسيق

source: Commitment
ar: التزام

source: Arzaq
ar: أرزاق

source: Creative Media Department
ar: قسم الميديا الإبداعي

source: Creates media content and shapes the team’s visual presence.
ar: تصنع محتوى إعلاميًا وتبني حضور الفريق البصري.

source: Ozzie
ar: أوزي

source: Role to be confirmed
ar: الدور قيد التحديد

source: Details for this member will be updated soon.
ar: سيتم تحديث تفاصيل هذا العضو قريبًا.

source: Coming
ar: قريب

source: Soon
ar: قريبًا

source: Alzyani
ar: الزياني

source: Team Photographer
ar: مصور الفريق

source: Documents team activities with a professional eye.
ar: يوثق أنشطة الفريق بعدسة احترافية.

source: Lighting
ar: إضاءة

source: Noor
ar: نور

source: Team Member
ar: عضو في الفريق

source: Supports the team with a collaborative spirit.
ar: يدعم الفريق بروح تعاونية.

source: Adaptability
ar: مرونة

source: Al-Maqrahi (Son of the South)
ar: المقرحي (ولد الجنوب)

source: Contributes to the team’s progress with positive energy.
ar: يسهم في تقدم الفريق بطاقة إيجابية.

source: Enthusiasm
ar: حماس

source: Responsibility
ar: مسؤولية
